---
kind: property
id: P:Autodesk.Revit.DB.PolyLine.NumberOfCoordinates
zh: 多段线、折线
source: html/425f6a09-5528-b4b1-b5b3-d472d2a508bf.htm
---
# Autodesk.Revit.DB.PolyLine.NumberOfCoordinates Property

**中文**: 多段线、折线

Gets the number of the coordinate points.

## Syntax (C#)
```csharp
public int NumberOfCoordinates { get; }
```